embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/driver_examples/powerquad/filter/powerquad_filter.c
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_debug_console.h"
#include "board.h"
#include "fsl_powerquad.h"
#include "math.h"

#include "pin_mux.h"
#include "clock_config.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define DEMO_POWERQUAD POWERQUAD
#define MATH_PI 3.1415926535898
#define FLOAT_2_Q31(x) ((int32_t)((x)*2147483648.0f))
#define FLOAT_2_Q15(x) (int16_t) __SSAT(((int32_t)((x)*32768.0f)), 16)
#define EXAMPLE_ASSERT_TRUE(x)            \
    if (!(x))                             \
    {                                     \
        PRINTF("%s error\r\n", __func__); \
        while (1)                         \
        {                                 \
        }                                 \
    }

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void PQ_Vector16BiqaudDf2FPExample(void);
static void PQ_Vector16BiqaudDf2FXExample(void);
static void PQ_16ByteBiquadCascadedf2FPExample(void);
static void PQ_16ByteBiquadCascadedf2FXExample(void);

static void PQ_VectorBiqaudDf2FloatExample(void);
static void PQ_VectorBiqaudDf2Fixed32Example(void);
static void PQ_VectorBiqaudDf2Fixed16Example(void);
static void PQ_BiquadCascadedf2FloatExample(void);
static void PQ_BiquadCascadedf2Fixed32Example(void);
static void PQ_BiquadCascadedf2Fixed16Example(void);
static void PQ_FIRFixed16Example(void);
static void PQ_FIRFixed32Example(void);
static void PQ_FIRFloatExample(void);
static void PQ_ConvolutionFixed16Example(void);
static void PQ_ConvolutionFixed32Example(void);
static void PQ_ConvolutionFloatExample(void);
static void PQ_CorrelationFixed16Example(void);
static void PQ_CorrelationFixed32Example(void);
static void PQ_CorrelationFloatExample(void);

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief Main function
 */
int main(void)
{
    /* Board pin, clock, debug console init */
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();

    /* Power up PQ RAM. */
    SYSCTL0->PDRUNCFG1_CLR = SYSCTL0_PDRUNCFG1_PQ_SRAM_APD_MASK | SYSCTL0_PDRUNCFG1_PQ_SRAM_PPD_MASK;
    /* Apply power setting. */
    PMC->CTRL |= PMC_CTRL_APPLYCFG_MASK;

    PRINTF("POWERQUAD filter example started\r\n");

    PQ_Init(DEMO_POWERQUAD);

    PQ_Vector16BiqaudDf2FPExample();
    PQ_Vector16BiqaudDf2FXExample();
    PQ_16ByteBiquadCascadedf2FPExample();
    PQ_16ByteBiquadCascadedf2FXExample();

    PQ_VectorBiqaudDf2FloatExample();
    PQ_VectorBiqaudDf2Fixed32Example();
    PQ_VectorBiqaudDf2Fixed16Example();
    PQ_BiquadCascadedf2FloatExample();
    PQ_BiquadCascadedf2Fixed32Example();
    PQ_BiquadCascadedf2Fixed16Example();
    PQ_FIRFixed16Example();
    PQ_FIRFixed32Example();
    PQ_FIRFloatExample();
    PQ_ConvolutionFixed16Example();
    PQ_ConvolutionFixed32Example();
    PQ_ConvolutionFloatExample();
    PQ_CorrelationFixed16Example();
    PQ_CorrelationFixed32Example();
    PQ_CorrelationFloatExample();

    PRINTF("POWERQUAD filter example successed\r\n");

    while (1)
    {
    }
}

static void PQ_Vector16BiqaudDf2FPExample(void)
{
    pq_biquad_state_t state = {
        .compreg = 0,
        .param =
            {
                .v_n_1 = 0.0f,
                .v_n = 0.0f,
                .a_1 = 0.2514f,
                .a_2 = 0.5028f,
                .b_0 = 0.2514f,
                .b_1 = -0.1712f,
                .b_2 = 0.1768f,
            },
    };

    float dataForBiquad[16] = {1024.0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    float biquadResult[16] = {0};
    float biquadRef[16] = {257.433594, -240.027618, 111.948532, 92.542015, -79.552780, -26.530556,
                           46.668919,  1.606997,    -23.869129, 5.192701,  10.695952,  -5.299852,
                           -4.045542,  3.681815,    1.108490,   -2.129891};

    // Init the biquad0 filter
    PQ_BiquadRestoreInternalState(DEMO_POWERQUAD, 0, &state);

    PQ_Vector16BiqaudDf2FP(dataForBiquad, biquadResult);

    for (uint32_t i = 0; i < ARRAY_SIZE(dataForBiquad); i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(biquadRef[i] - biquadResult[i]) < 0.00001);
    }
}

static void PQ_Vector16BiqaudDf2FXExample(void)
{
    pq_biquad_state_t state = {
        .compreg = 0,
        .param =
            {
                .v_n_1 = 0.0f,
                .v_n = 0.0f,
                .a_1 = 0.2514f,
                .a_2 = 0.5028f,
                .b_0 = 0.2514f,
                .b_1 = -0.1712f,
                .b_2 = 0.1768f,
            },
    };

    int32_t dataForBiquad[16] = {1024, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    int32_t biquadResult[16] = {0};
    int32_t biquadRef[16] = {257, -240, 112, 93, -80, -27, 47, 2, -24, 5, 11, -5, -4, 4, 1, -2};

    pq_prescale_t prescale;
    prescale.inputPrescale = 0;
    prescale.outputPrescale = 0;
    prescale.outputSaturate = 0;

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    // Init the biquad0 filter
    PQ_BiquadRestoreInternalState(DEMO_POWERQUAD, 0, &state);

    PQ_Vector16BiqaudDf2FX(dataForBiquad, biquadResult);

    for (uint32_t i = 0; i < ARRAY_SIZE(biquadRef); i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }
}

/* Float biquad cascade IIR */
static void PQ_16ByteBiquadCascadedf2FPExample(void)
{
    uint8_t stage = 3;

    pq_biquad_state_t state[3] = {
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
    };

