embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/driver_examples/powerquad/filter/powerquad_filter.c
    float dataForBiquad[16] = {1024.0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    float biquadResult[16] = {0};
    float biquadRef[16] = {16.270306, -45.510643, 63.659611,  -35.223492, -20.120678, 45.005569, -14.585688, -26.120077,
                           25.420242, 6.363828,   -21.309111, 4.942792,   12.659100,  -8.400287, -5.238772,  7.446815};

    pq_biquad_cascade_df2_instance instance;

    /* Calculate all result one time. */
    PQ_BiquadCascadeDf2Init(&instance, stage, state);

    PQ_16ByteBiquadCascadeDf2FP(&instance, dataForBiquad, biquadResult, 15);
    for (uint32_t i = 0; i < 15; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(biquadRef[i] - biquadResult[i]) < 0.00001);
    }
}

static void PQ_16ByteBiquadCascadedf2FXExample(void)
{
    uint8_t stage = 3;

    pq_biquad_state_t state[3] = {
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
    };

    int32_t dataForBiquad[16] = {1024, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    int32_t biquadResult[16] = {0};
    int32_t biquadRef[16] = {16, -46, 64, -35, -20, 45, -15, -26, 25, 6, -21, 5, 13, -8, -5, 7};

    pq_biquad_cascade_df2_instance instance;

    /* Calculate all result one time. */
    PQ_BiquadCascadeDf2Init(&instance, stage, state);
    PQ_16ByteBiquadCascadeDf2FX(&instance, dataForBiquad, biquadResult, 15);

    for (uint32_t i = 0; i < 15; i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }
}

static void PQ_VectorBiqaudDf2FloatExample(void)
{
    pq_biquad_state_t state = {
        .compreg = 0,
        .param =
            {
                .v_n_1 = 0.0f,
                .v_n = 0.0f,
                .a_1 = 0.2514f,
                .a_2 = 0.5028f,
                .b_0 = 0.2514f,
                .b_1 = -0.1712f,
                .b_2 = 0.1768f,
            },
    };

    float dataForBiquad[16] = {1024.0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    float biquadResult[16] = {0};
    float biquadRef[16] = {257.433594, -240.027618, 111.948532, 92.542015, -79.552780, -26.530556,
                           46.668919,  1.606997,    -23.869129, 5.192701,  10.695952,  -5.299852,
                           -4.045542,  3.681815,    1.108490,   -2.129891};

    // Init the biquad0 filter
    PQ_BiquadRestoreInternalState(DEMO_POWERQUAD, 0, &state);

    PQ_VectorBiqaudDf2F32(dataForBiquad, biquadResult, ARRAY_SIZE(dataForBiquad));

    for (uint32_t i = 0; i < ARRAY_SIZE(dataForBiquad); i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(biquadRef[i] - biquadResult[i]) < 0.00001);
    }
}

static void PQ_VectorBiqaudDf2Fixed32Example(void)
{
    pq_biquad_state_t state = {
        .compreg = 0,
        .param =
            {
                .v_n_1 = 0.0f,
                .v_n = 0.0f,
                .a_1 = 0.2514f,
                .a_2 = 0.5028f,
                .b_0 = 0.2514f,
                .b_1 = -0.1712f,
                .b_2 = 0.1768f,
            },
    };

    int32_t dataForBiquad[16] = {1024, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    int32_t biquadResult[16] = {0};
    int32_t biquadRef[16] = {257, -240, 112, 93, -80, -27, 47, 2, -24, 5, 11, -5, -4, 4, 1, -2};

    pq_prescale_t prescale;
    prescale.inputPrescale = 0;
    prescale.outputPrescale = 0;
    prescale.outputSaturate = 0;

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    // Init the biquad0 filter
    PQ_BiquadRestoreInternalState(DEMO_POWERQUAD, 0, &state);

    PQ_VectorBiqaudDf2Fixed32(dataForBiquad, biquadResult, ARRAY_SIZE(biquadRef));

    for (uint32_t i = 0; i < ARRAY_SIZE(biquadRef); i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }
}

static void PQ_VectorBiqaudDf2Fixed16Example(void)
{
    pq_biquad_state_t state = {
        .compreg = 0,
        .param =
            {
                .v_n_1 = 0.0f,
                .v_n = 0.0f,
                .a_1 = 0.2514f,
                .a_2 = 0.5028f,
                .b_0 = 0.2514f,
                .b_1 = -0.1712f,
                .b_2 = 0.1768f,
            },
    };

    int16_t dataForBiquad[16] = {1024, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    int16_t biquadResult[16] = {0};
    int16_t biquadRef[16] = {257, -240, 112, 93, -80, -27, 47, 2, -24, 5, 11, -5, -4, 4, 1, -2};

    pq_prescale_t prescale;
    prescale.inputPrescale = 0;
    prescale.outputPrescale = 0;
    prescale.outputSaturate = 0;

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    // Init the biquad0 filter
    PQ_BiquadRestoreInternalState(DEMO_POWERQUAD, 0, &state);

    PQ_VectorBiqaudDf2Fixed16(dataForBiquad, biquadResult, ARRAY_SIZE(biquadRef));

    for (uint32_t i = 0; i < ARRAY_SIZE(biquadRef); i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }
}

/* Float biquad cascade IIR */
static void PQ_BiquadCascadedf2FloatExample(void)
{
    uint8_t stage = 3;

    pq_biquad_state_t state[3] = {
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
    };

