embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/driver_examples/powerquad/filter/powerquad_filter.c
    float dataForBiquad[16] = {1024.0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    float biquadResult[16] = {0};
    float biquadRef[16] = {16.270306, -45.510643, 63.659611,  -35.223492, -20.120678, 45.005569, -14.585688, -26.120077,
                           25.420242, 6.363828,   -21.309111, 4.942792,   12.659100,  -8.400287, -5.238772,  7.446815};

    pq_biquad_cascade_df2_instance instance;

    /* Calculate all result one time. */
    PQ_BiquadCascadeDf2Init(&instance, stage, state);

    PQ_BiquadCascadeDf2F32(&instance, dataForBiquad, biquadResult, 15);
    for (uint32_t i = 0; i < 15; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(biquadRef[i] - biquadResult[i]) < 0.00001);
    }

    /* Incremental calculation. */
    for (uint32_t i = 0; i < 3; i++)
    {
        state[i].compreg = 0;
        state[i].param.v_n_1 = 0.0f;
        state[i].param.v_n = 0.0f;
    }
    memset(biquadResult, 0, sizeof(biquadResult));

    PQ_BiquadCascadeDf2Init(&instance, stage, state);

    PQ_BiquadCascadeDf2F32(&instance, dataForBiquad, biquadResult, 8);
    PQ_BiquadCascadeDf2F32(&instance, &dataForBiquad[8], &biquadResult[8], 7);

    for (uint32_t i = 0; i < 15; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(biquadRef[i] - biquadResult[i]) < 0.00001);
    }
}

static void PQ_BiquadCascadedf2Fixed32Example(void)
{
    uint8_t stage = 3;

    pq_biquad_state_t state[3] = {
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
    };

    int32_t dataForBiquad[16] = {1024, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    int32_t biquadResult[16] = {0};
    int32_t biquadRef[16] = {16, -46, 64, -35, -20, 45, -15, -26, 25, 6, -21, 5, 13, -8, -5, 7};

    pq_biquad_cascade_df2_instance instance;

    /* Calculate all result one time. */
    PQ_BiquadCascadeDf2Init(&instance, stage, state);
    PQ_BiquadCascadeDf2Fixed32(&instance, dataForBiquad, biquadResult, 15);

    for (uint32_t i = 0; i < 15; i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }

    /* Incremental calculation. */
    for (uint32_t i = 0; i < 3; i++)
    {
        state[i].compreg = 0;
        state[i].param.v_n_1 = 0.0f;
        state[i].param.v_n = 0.0f;
    }
    memset(biquadResult, 0, sizeof(biquadResult));

    PQ_BiquadCascadeDf2Init(&instance, stage, state);
    PQ_BiquadCascadeDf2Fixed32(&instance, dataForBiquad, biquadResult, 8);
    PQ_BiquadCascadeDf2Fixed32(&instance, &dataForBiquad[8], &biquadResult[8], 7);

    for (uint32_t i = 0; i < 15; i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }
}

static void PQ_BiquadCascadedf2Fixed16Example(void)
{
    uint8_t stage = 3;
    pq_biquad_state_t state[3] = {
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
        {
            .compreg = 0,
            .param =
                {
                    .v_n_1 = 0.0f,
                    .v_n = 0.0f,
                    .a_1 = 0.2514f,
                    .a_2 = 0.5028f,
                    .b_0 = 0.2514f,
                    .b_1 = -0.1712f,
                    .b_2 = 0.1768f,
                },
        },
    };
    int16_t dataForBiquad[16] = {1024, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    int16_t biquadResult[16] = {0};
    int16_t biquadRef[16] = {16, -46, 64, -35, -20, 45, -15, -26, 25, 6, -21, 5, 13, -8, -5, 7};

    pq_biquad_cascade_df2_instance instance;

    /* Calculate all result one time. */
    PQ_BiquadCascadeDf2Init(&instance, stage, state);
    PQ_BiquadCascadeDf2Fixed16(&instance, dataForBiquad, biquadResult, 15);

    for (uint32_t i = 0; i < 15; i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }

    /* Incremental calculation. */
    for (uint32_t i = 0; i < 3; i++)
    {
        state[i].compreg = 0;
        state[i].param.v_n_1 = 0.0f;
        state[i].param.v_n = 0.0f;
    }
    memset(biquadResult, 0, sizeof(biquadResult));

    PQ_BiquadCascadeDf2Init(&instance, stage, state);
    PQ_BiquadCascadeDf2Fixed16(&instance, dataForBiquad, biquadResult, 8);
    PQ_BiquadCascadeDf2Fixed16(&instance, &dataForBiquad[8], &biquadResult[8], 7);

    for (uint32_t i = 0; i < 15; i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }
}

static void PQ_FIRFixed16Example(void)
{
    int16_t dataForFIR[16] = {16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1};
    int16_t taps[12] = {7, 9, 11, 6, 8, 9, 3, 6, 3, 7, 3, 5};
    int16_t FIRRef[16] = {112, 249, 409, 478, 573, 676, 674, 717, 706, 756, 735, 743, 666, 589, 512, 435};
    int16_t FIRResult[16] = {0};

