embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/driver_examples/powerquad/filter/powerquad_filter.c
    PQ_SetFormat(DEMO_POWERQUAD, kPQ_CP_FIR, kPQ_16Bit);

    /* Calculation one time. */
    PQ_FIR(DEMO_POWERQUAD, dataForFIR, 16, taps, 12, FIRResult, PQ_FIR_FIR);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < 16; i++)
    {
        EXAMPLE_ASSERT_TRUE(FIRRef[i] == FIRResult[i]);
    }

    /* Incremental calculation. */
    memset(FIRResult, 0, sizeof(FIRResult));

    /* Process the first 10 data. */
    PQ_FIR(DEMO_POWERQUAD, dataForFIR, 10, taps, 12, FIRResult, PQ_FIR_FIR);
    PQ_WaitDone(DEMO_POWERQUAD);

    /* Process the remaining 6 data. */
    PQ_FIRIncrement(DEMO_POWERQUAD, 6, 12, 10);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < 16; i++)
    {
        EXAMPLE_ASSERT_TRUE(FIRRef[i] == FIRResult[i]);
    }
}

static void PQ_FIRFixed32Example(void)
{
    int32_t dataForFIR[16] = {16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1};
    int32_t taps[12] = {7, 9, 11, 6, 8, 9, 3, 6, 3, 7, 3, 5};
    int32_t FIRRef[16] = {112, 249, 409, 478, 573, 676, 674, 717, 706, 756, 735, 743, 666, 589, 512, 435};
    int32_t FIRResult[16] = {0};

    PQ_SetFormat(DEMO_POWERQUAD, kPQ_CP_FIR, kPQ_32Bit);

    /* Calculation one time. */
    PQ_FIR(DEMO_POWERQUAD, dataForFIR, 16, taps, 12, FIRResult, PQ_FIR_FIR);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < 16; i++)
    {
        EXAMPLE_ASSERT_TRUE(FIRRef[i] == FIRResult[i]);
    }

    /* Incremental calculation. */
    memset(FIRResult, 0, sizeof(FIRResult));

    /* Process the first 10 data. */
    PQ_FIR(DEMO_POWERQUAD, dataForFIR, 10, taps, 12, FIRResult, PQ_FIR_FIR);
    PQ_WaitDone(DEMO_POWERQUAD);

    /* Process the remaining 6 data. */
    PQ_FIRIncrement(DEMO_POWERQUAD, 6, 12, 10);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < 16; i++)
    {
        EXAMPLE_ASSERT_TRUE(FIRRef[i] == FIRResult[i]);
    }
}

/* Float FIR */
static void PQ_FIRFloatExample(void)
{
    float dataForFIR[16] = {16.0, 15.0, 14.0, 13.0, 12.0, 11.0, 10.0, 9.0, 8.0, 7.0, 6.0, 5.0, 4.0, 3.0, 2.0, 1.0};
    float taps[12] = {7, 9, 11, 6, 8, 9, 3, 6, 3, 7, 3, 5};
    float FIRRef[16] = {112.0, 249.0, 409.0, 478.0, 573.0, 676.0, 674.0, 717.0,
                        706.0, 756.0, 735.0, 743.0, 666.0, 589.0, 512.0, 435.0};
    float FIRResult[16] = {0};

    PQ_SetFormat(DEMO_POWERQUAD, kPQ_CP_FIR, kPQ_Float);

    /* Calculation one time. */
    PQ_FIR(DEMO_POWERQUAD, dataForFIR, 16, taps, 12, FIRResult, PQ_FIR_FIR);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < 16; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(FIRRef[i] - FIRResult[i]) < 0.00001);
    }

    /* Incremental calculation. */
    memset(FIRResult, 0, sizeof(FIRResult));

    /* Process the first 10 data. */
    PQ_FIR(DEMO_POWERQUAD, dataForFIR, 10, taps, 12, FIRResult, PQ_FIR_FIR);
    PQ_WaitDone(DEMO_POWERQUAD);

    /* Process the remaining 6 data. */
    PQ_FIRIncrement(DEMO_POWERQUAD, 6, 12, 10);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < 16; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(FIRRef[i] - FIRResult[i]) < 0.00001);
    }
}

static void PQ_ConvolutionFixed16Example(void)
{
    int16_t dataForConvA[5] = {1, 2, 3, 4, 5};
    int16_t dataForConvB[5] = {2, 4, 6, 8, 10};
    int16_t convRef[9] = {2, 8, 20, 40, 70, 88, 92, 80, 50};
    int16_t convResult[9] = {0};

    PQ_SetFormat(DEMO_POWERQUAD, kPQ_CP_FIR, kPQ_16Bit);

    PQ_FIR(DEMO_POWERQUAD, dataForConvA, 5, dataForConvB, 5, convResult, PQ_FIR_CONVOLUTION);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < ARRAY_SIZE(convRef); i++)
    {
        EXAMPLE_ASSERT_TRUE(convRef[i] == convResult[i]);
    }
}

static void PQ_ConvolutionFixed32Example(void)
{
    int32_t dataForConvA[5] = {1, 2, 3, 4, 5};
    int32_t dataForConvB[5] = {2, 4, 6, 8, 10};
    int32_t convRef[9] = {2, 8, 20, 40, 70, 88, 92, 80, 50};
    int32_t convResult[9] = {0};

    PQ_SetFormat(DEMO_POWERQUAD, kPQ_CP_FIR, kPQ_32Bit);

    PQ_FIR(DEMO_POWERQUAD, dataForConvA, 5, dataForConvB, 5, convResult, PQ_FIR_CONVOLUTION);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < ARRAY_SIZE(convRef); i++)
    {
        EXAMPLE_ASSERT_TRUE(convRef[i] == convResult[i]);
    }
}

/* Float Convolution */
static void PQ_ConvolutionFloatExample(void)
{
    float dataForConvA[5] = {1.1, 2.2, 3.3, 4.4, 5.5};
    float dataForConvB[5] = {0.1, 0.2, 0.3, 0.4, 0.5};
    float convRef[9] = {0.11, 0.44, 1.1, 2.2, 3.85, 4.84, 5.06, 4.4, 2.75};
    float convResult[9] = {0};

    PQ_SetFormat(DEMO_POWERQUAD, kPQ_CP_FIR, kPQ_Float);

    PQ_FIR(DEMO_POWERQUAD, dataForConvA, 5, dataForConvB, 5, convResult, PQ_FIR_CONVOLUTION);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < ARRAY_SIZE(convRef); i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(convRef[i] - convResult[i]) < 0.00001);
    }
}

static void PQ_CorrelationFixed16Example(void)
{
    int16_t dataForCorrelA[5] = {1, 2, 3, 4, 5};
    int16_t dataForCorrelB[5] = {2, 4, 6, 8, 10};
    int16_t correlRef[9] = {10, 28, 52, 80, 110, 80, 52, 28, 10};
    int16_t correlResult[9] = {0};

    PQ_SetFormat(DEMO_POWERQUAD, kPQ_CP_FIR, kPQ_16Bit);

    PQ_FIR(DEMO_POWERQUAD, dataForCorrelA, 5, dataForCorrelB, 5, correlResult, PQ_FIR_CORRELATION);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < ARRAY_SIZE(correlRef); i++)
    {
        EXAMPLE_ASSERT_TRUE(correlRef[i] == correlResult[i]);
    }
}

static void PQ_CorrelationFixed32Example(void)
{
    int32_t dataForCorrelA[5] = {1, 2, 3, 4, 5};
    int32_t dataForCorrelB[5] = {2, 4, 6, 8, 10};
    int32_t correlRef[9] = {10, 28, 52, 80, 110, 80, 52, 28, 10};
    int32_t correlResult[9] = {0};

    PQ_SetFormat(DEMO_POWERQUAD, kPQ_CP_FIR, kPQ_32Bit);

    PQ_FIR(DEMO_POWERQUAD, dataForCorrelA, 5, dataForCorrelB, 5, correlResult, PQ_FIR_CORRELATION);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < ARRAY_SIZE(correlRef); i++)
    {
        EXAMPLE_ASSERT_TRUE(correlRef[i] == correlResult[i]);
    }
}

/* Float Correlation */
static void PQ_CorrelationFloatExample(void)
{
    float dataForCorrelA[5] = {1.1, 2.2, 3.3, 4.4, 5.5};
    float dataForCorrelB[5] = {0.1, 0.2, 0.3, 0.4, 0.5};
    float correlRef[9] = {0.55, 1.54, 2.86, 4.4, 6.05, 4.4, 2.86, 1.54, 0.55};
    float correlResult[9] = {0};

    PQ_SetFormat(DEMO_POWERQUAD, kPQ_CP_FIR, kPQ_Float);

    PQ_FIR(DEMO_POWERQUAD, dataForCorrelA, 5, dataForCorrelB, 5, correlResult, PQ_FIR_CORRELATION);
    PQ_WaitDone(DEMO_POWERQUAD);

    for (uint32_t i = 0; i < ARRAY_SIZE(correlRef); i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(correlRef[i] - correlResult[i]) < 0.00001);
    }
}
